Revit 2024 API
BuiltInFailures.ConversionFailures.CannotConvertPercentToDouble Property
 Cannot convert concentration percent ' [Percentage Value] ' to double value
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotConvertPercentToDouble { get; }
Visual Basic
Public Shared ReadOnly Property CannotConvertPercentToDouble As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotConvertPercentToDouble {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.ConversionFailures Class
Autodesk.Revit.DB Namespace